about.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://rillonline.github.io/rss.xml"
      title="RSS feed for https://rillonline.github.io/">
<title>About</title>
</head>
<body>
<div id="preamble" class="status"><div class="sitelinks">
<a href="https://rillonline.github.io/">Home</a> | <a href="https://rillonline.github.io/list-of-tags.html">List of Tags</a> |
<a href="https://rillonline.github.io/about.html">About</a>
 </div><div><h1>Hey there 👋 You are reading Rill Online.</h1></div></div>
<div id="content">
<div class="post-date">10 Sep 2025</div><h1 class="post-title"><a href="https://rillonline.github.io/about.html">About</a></h1>
<p>
I write to please myself and if I can inspire, help or make you laugh, that pleases me.
</p>

<p>
On these pages, you will find a range of material:
</p>

<ul class="org-ul">
<li>autobiographical pieces</li>
<li>essays</li>
<li>poetry</li>
<li>fiction, mostly fantasy/science fiction</li>
<li>technical info especially directed toward the visually impaired user</li>
<li>sermons and other spiritual writing</li>
</ul>

<p>
I have worked as a programmer and as a Christian minister. I have been blind since an early age. Currently. I am now retired.
</p>
<div class="taglist"><a href="https://rillonline.github.io/tags.html">Tags</a>: <a href="https://rillonline.github.io/tag-blog.html">Blog</a> </div><footer class="post-footer">
 <p>Thanks for reading.</p>
</footer></div>
<div id="postamble" class="status">
   <div class="post-meta">
   <div class="creator">
   <p>This blog post was created by Rill on a Raspberry Pi, with the help of <a href="https://www.gnu.org/software/emacs/">GNU Emacs</a>, <a href="https://orgmode.org/">Org mode</a>, and the <a href="https://github.com/bastibe/org-static-blog">org-static-blog</a> package.</p>
   </div>
   <div class="copyright-license">
   <p>© 2025 by Rill. Unless otherwise stated, all material is licensed under a <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/">Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License</a>.</p>
   </div>
  </div>
 </div>
</body>
</html>
